/**
 * В этом пакете представлен класс "FilterPage" для работы с фильтрами по необходимой категории товаров
 * <br/> Этот класс реализующий паттерн "Page Object",
 * <br/> необходимый для работы с веб-страницей. Класс содержит поля - "элементы страницы - поля фильтров", а
 * <br/> так же методы, необходимые для навигации и заполнения фильтров по необходимым параметрам поиска товаров.
 * <br/> В данном классе есть методы, проверяющие заполнение фильтров.
 * @author Борис Демин
 */
package pages.filters;